artillery_tests/GET_products.yml
config:
  target: "http://localhost:3030"
  phases:
    - duration: 10
      arrivalRate: 50
      name: Products stress

scenarios:
  - name: "Get products"
    flow:
      - get:
          url: "/products"
  - name: "Get product by id"
    flow:
      - get:
          url: "/products/1"
  - name: "Get styles by id"
    flow:
      - get:
          url: "/products/1/styles"
  - name: "Get related products"
    flow:
      - get:
          url: "/products/1/related"